import React from "react";
import styles from './production.module.sass'

const Production = () => {
    return (
            <div  className={styles.pro}>
                <h1>наші послуги</h1>
                <ul>
                    <li>Наші спеціалісти проводять діагностику приміщень та визначають проблему на обєктах вражених грибком та вологістю</li>
                    <li>Проводяться висушувальні роботи без пошкоджень приміщень</li>
                    <li>При потребі оброляється  хімічним європейським препаратом  “E-larix”</li>
                    <li>Прибирається з приміщення надлишок вологи завдяки потужним вологозберачам</li>
                    <li>Проводяться інєкційні та гідроізоляційні роботи </li>
                    <li>Якісно , швидко і акуратно   виконуємо роботу </li>
                    <li>Встановлення електричного низькотемпературного опалення</li>
                    <li>Проведення озонування житлових та офісних приміщень</li>
                    <li>Робота із ртуттю</li>
                </ul>
            </div>
    )
}
export default Production
